[
    {
        "id": 0,
        "name" : "Palbro",
        "site" : "https://palbro.virgilebaisnee.fr",
        "icon" : "palbro.png",
        "shortDesc" : "A Palworld Companion",
        "desc" : [
            "Welcome to the world of PalBro, an innovative companion app for Palworld fans.",
            "Inspired by the Pokédex, PalBro enhances the gaming experience with detailed info on every Pal."
        ],
        "functionalities": [
            "Comprehensive Pal Database: Access names, numbers, stats, attacks, descriptions, drops, and spawn points.",
            "Capture Tracking: Track captures bonuses for each Pal up to 10.",
            "Management of Pals: List obtained and obtainable Pals based on your collection.",
            "Breeding and Combinations: Discover combinations to obtain new species.",
            "Item Search: Find which Pals drop the items you need.",
            "Multi-Game Handling: Track progression across multiple game servers using the gamepad icon in the top bar."
        ],
        "lastDesc": "PalBro is developed to provide an intuitive and powerful tool for Palworld players, seamlessly integrating into their gaming routine.",
        "technos" : {
            "back": [
                "Node.js"
            ],
            "front" : [
                "React"
            ],
            "other": [

            ]
        }
    }
    ,
    {
        "id": 1,
        "name" : "Concerto",
        "site" : "http://192.168.1.24:8000/",
        "icon" : "concerto.png",
        "shortDesc" : "A Development Project Management Tool",
        "desc" : [
            "Introducing Concerto, a personal development project management tool designed to streamline your workflow.",
            "Concerto allows you to jot down project ideas, organize tasks, and allocate time efficiently, all within a user-friendly interface."
        ],
        "functionalities": [
            "Idea Management: Easily document and categorize new project ideas.",
            "Task Management: Break down projects into tasks, set priorities, and track progress.",
            "Time Allocation: Assign estimated and actual time to tasks for better planning and retrospection.",
            "Authentication: Secure login using OAuth.",
            "Real-time Metrics: Monitor project metrics and progress with integrated Grafana dashboards."
        ],
        "lastDesc": "Concerto is a lightweight yet powerful tool developed to assist in managing development projects efficiently.",
        "technos" : {
            "back": [
                "Symfony",
                "MySQL"
            ],
            "front" : [
                "JavaScript",
                "Bootstrap",
                "Twig"
            ],
            "other": [
                "Docker",
                "Grafana",
                "OAuth"
            ]
        }
    }
    
]